Repository: xfce-mirror/xfce4-screensaver
Catalog: po/*.po
Languages: kk, ug

source: Xfce Screensaver
kk: Xfce экран сақтағышы
ug: Xfce ئېكران قوغدىغۇچ

source: Set your screensaver preferences
kk: Экран сақтағышының баптауларын орнату
ug: ئېكران قوغدىغۇچ مايىللىقىڭىزنى تەڭشەڭ

source: Screensaver
kk: Экран қорғаушысы
ug: ئېكران قوغدىغۇچ

source: settings;preferences;screensaver;lock screen;
kk: settings;preferences;screensaver;lock screen;баптаулар;параметрлер;экран сақтағышы;экранды бұғаттау;
ug: تەڭشەك؛مايىللىق؛ئېكران قوغدىغۇچ؛قۇلۇپ ئېكران؛

source: Screensavers
kk: Экран сақтағыштары
ug: ئېكران قوغدىغۇچ

source: Screensaver themes
kk: Экран сақтағыштарының темалары
ug: ئېكران قوغدىغۇچ ئۆرنەك

source: Show paths that images follow
kk: Суреттер жүретін жолдарды көрсету
ug: سۈرەت ئەگىشىدىغان يولنى كۆرسىتىدۇ

source: Occasionally rotate images as they move
kk: Суреттер қозғалған кезде оларды кейде бұру
ug: سۈرەت يۆتكەش جەريانىدا ئاندا-ساندا چۆرگىلەيدۇ

source: Print out frame rate and other statistics
kk: Кадр жиілігін және басқа статистиканы шығару
ug: كاندۇك نىسبىتى ۋە باشقا ئىستاتىستىكىنى بېسىپ چىقىرىدۇ

source: The maximum number of images to keep on screen
kk: Экранда көрсетілетін суреттердің максималды саны
ug: ئېكراندا ساقلاپ قالىدىغان ئەڭ كۆپ سۈرەت سانى

source: The initial size and position of window
kk: Терезенің бастапқы өлшемі мен орны
ug: كۆزنەكنىڭ دەسلەپكى چوڭلۇقى ۋە ئورنى

source: WIDTHxHEIGHT+X+Y
ug: كەڭلىكxئېگىزلىك+X+Y

source: The source image to use
kk: Қолданылатын бастапқы сурет
ug: ئىشلىتىدىغان ئەسلى سۈرەت

source: image - floats images around the screen
kk: image - суреттерді экран бойымен қозғалтады
ug: image - ئېكراندا سۈرەتنى لەيلەت

source: %s. See --help for usage information.
kk: %s. Қолдану туралы ақпаратты --help арқылы қараңыз.
ug: %s . --help ئىشلىتىش ئۇسۇلىنىڭ ئۇچۇرى.

source: Failed to initialize the windowing system.
kk: Терезе жүйесін инициализациялау сәтсіз аяқталды.
ug: كۆزنەك سىستېمىسىنى دەسلەپلەشتۈرەلمىدى.

source: You must specify one image. See --help for usage information.
kk: Сіз бір суретті көрсетуіңіз керек. Қолдану туралы ақпаратты --help арқылы қараңыз.
ug: سىز چوقۇم بىر پارچە سۈرەت بەلگىلەڭ. --help تىن پايدىلىنىپ ئىشلىتىش ئۇسۇلى ئۇچۇرىغا ئېرىشىڭ.

source: Location to get images from
kk: Суреттер алынатын орын
ug: سۈرەتكە ئېرىشىدىغان ئورۇن

source: PATH
kk: ОРНАЛАСУ
ug: يول

source: Color to use for images background
kk: Суреттер фоны үшін қолданылатын түс
ug: سۈرەت تەگلىكىگە ئىشلەتكەن رەڭ

source: Do not randomize pictures from location
kk: Орналасудан суреттерді кездейсоқ таңдамау
ug: ئورۇندىن خالىغانچە سۈرەت تاللىما

source: Do not try to stretch images on screen
kk: Суреттерді экранға созбау
ug: ئېكراندا سۈرەتنى يايما

source: Do not crop images to the screen size
kk: Суреттерді экран өлшеміне дейін қиып алмау
ug: سۈرەتنى ئېكران چوڭلۇقىدا قايچىلىما

source: Floating Xfce
kk: Қалқымалы Xfce
ug: لەيلىمە Xfce

source: Bubbles the Xfce logo around the screen
kk: Экранда Xfce логотипін көпіршіктер түрінде жылжытады
ug: ئېكران دائىرىسىدە Xfce تۇغىنىڭ كۆپۈكىنى لەيلەت

source: Slideshow
kk: Слайдшоу
ug: تام تەسۋىرى

source: Display a slideshow from your Pictures folder
kk: Суреттер бумасынан слайдшоуды көрсету
ug: رەسىم قىسقۇچىڭىزدىن تام تەسۋىر كۆرسىتىدۇ

source: Pop art squares
kk: Поп-арт шаршылары
ug: مودا بەدىئىي چاسا

source: A pop-art-ish grid of pulsing colors.
kk: Соғып тұрған түстердің поп-арт стиліндегі торы.
ug: سەكرەيدىغان رەڭدىن تەشكىل تاپقان مودا بەدىئىي كاتەكچە.

source: Unable to establish service %s: %s
kk: %s қызметін орнату мүмкін емес: %s
ug: مۇلازىمەت قۇرالمىدى %s: %s

source: Can't set PAM_TTY=%s
kk: PAM_TTY=%s мәнін орнату мүмкін емес
ug: PAM_TTY تەڭشىيەلمىدى=%s

source: Incorrect password.
kk: Пароль қате.
ug: ئىم خاتا.

source: Authentication failed.
kk: Аутентификация сәтсіз аяқталды.
ug: دەلىللىيەلمىدى.

source: Not permitted to gain access at this time.
kk: Қазіргі уақытта қол жеткізуге рұқсат берілмеген.
ug: نۆۋەتتە زىيارەتكە ئېرىشكىلى بولمايدۇ.

source: No longer permitted to access the system.
kk: Жүйеге қол жеткізуге енді рұқсат жоқ.
ug: سىستېمىنى زىيارەت قىلىشقا يول قويۇلمايدۇ.

source: Username:
kk: Пайдаланушы аты:
ug: ئىشلەتكۈچى ئاتى:

source: failed to register with the message bus
kk: хабарламалар шинасында тіркелу сәтсіз аяқталды
ug: ئۇچۇر ئاساسىي لىنىيەسىنى خەتلىتەلمىدى

source: not connected to the message bus
kk: хабарламалар шинасына қосылмаған
ug: ئۇچۇر ئاساسىي لىنىيەسىگە باغلىنالمىدى

source: screensaver already running in this session
kk: экран сақтағышы бұл сессияда қазірдің өзінде қосулы тұр
ug: ئېكران قوغدىغۇچ بۇ ئەڭگىمەدە ئىجرا قىلىنىۋاتىدۇ

source: Time has expired.
kk: Уақыт аяқталды.
ug: ۋاقىت توشتى.

source: Causes the screensaver to exit gracefully
kk: Экран сақтағышының дұрыс аяқталуына мәжбүрлейді
ug: ئېكران قوغدىغۇچ ئادەتتىكىدەك چېكىنىدۇ

source: Query the state of the screensaver
kk: Экран сақтағышының күйін сұрау
ug: ئېكران قوغدىغۇچنىڭ ھالىتىنى سۈرۈشتۈرىدۇ

source: Query the length of time the screensaver has been active
kk: Экран сақтағышы белсенді болған уақыт ұзақтығын сұрау
ug: ئېكران قوغدىغۇچنىڭ ئاكتىپلانغان ۋاقتىنى سۈرۈشتۈرىدۇ

source: Tells the running screensaver process to lock the screen immediately
kk: Жұмыс істеп тұрған экран сақтағышы процесіне экранды дереу бұғаттауды бұйырады
ug: ئىجرا قىلىنىۋاتقان ئېكران قوغدىغۇچقا ئېكراننى دەرھال قۇلۇپلاشنى ئۇقتۇرىدۇ

source: If the screensaver is active then switch to another graphics demo
kk: Егер экран сақтағышы белсенді болса, басқа графикалық демоға ауысу
ug: ئەگەر ئېكران قوغدىغۇچ ئاكتىپ بولسا باشقا سۈرەت كۆرگەزمىسىگە ئالماشتۇرىدۇ

source: Turn the screensaver on (blank the screen)
kk: Экран сақтағышын қосу (экранды тазарту)
ug: ئېكران قوغدىغۇچنى ئاچىدۇ (قارا ئېكران)

source: If the screensaver is active then deactivate it (un-blank the screen)
kk: Егер экран сақтағышы белсенді болса, оны өшіру (экранды қалпына келтіру)
ug: ئەگەر ئېكران قوغدىغۇچ ئاكتىپ بولسا ئۇنى ئاكتىپسىز قىلىدۇ (قارا ئېكراننى بىكار قىلىدۇ)

source: Poke the running screensaver to simulate user activity
kk: Пайдаланушы әрекетін имитациялау үшін жұмыс істеп тұрған экран сақтағышына белгі беру
ug: ئىجرا قىلىنىۋاتقان ئېكران قوغدىغۇچقا ئۇچۇر يوللاپ ئىشلەتكۈچى ھەرىكىتىنى تەقلىد قىلىدۇ

source: Inhibit the screensaver from activating. Command blocks while inhibit is active.
kk: Экран сақтағышының белсендірілуіне тыйым салу. Тыйым салу белсенді болған кезде команда блокталады.
ug: ئېكران قوغدىغۇچ ئاكتىپلاشنى چەكلەيدۇ. ئاكتىپلانغاندا باشقا بۇيرۇق توسۇلىدۇ.

source: The calling application that is inhibiting the screensaver
kk: Экран сақтағышына тыйым салатын шақырушы қолданба
ug: ئېكران قوغدىغۇچنى چەكلەۋاتقان پىروگرامما

source: The reason for inhibiting the screensaver
kk: Экран сақтағышын тежеу себебі
ug: ئېكران قوغدىغۇچنى چەكلەشنىڭ سەۋەبى

source: Version of this application
kk: Бұл қолданбаның нұсқасы
ug: بۇ پىروگراممىنىڭ نەشرى

source: The screensaver is %s
kk: Экран сақтағышы: %s
ug: ئېكران قوغدىغۇچ %s

source: active
kk: белсенді
ug: ئاكتىپ

source: inactive
kk: белсенді емес
ug: ئاكتىپسىز

source: The screensaver is not inhibited
kk: Экран сақтағышы тежелмеген
ug: ئېكران قوغدىغۇچ چەكلەنمىدى

source: The screensaver is being inhibited by:
kk: Экран сақтағышын тежеп тұрған:
ug: ئېكران قوغدىغۇچنى چەكلىگۈچى:

source: The screensaver has been active for %d seconds.
kk: Экран сақтағышы %d секунд бойы белсенді.
ug: ئېكران قوغدىغۇچ %d سېكۇنت ئىجرا قىلىندى.

source: Part of Xfce Screensaver
kk: Xfce Screensaver бөлігі
ug: Xfce ئېكران قوغدىغۇچنىڭ بىر بۆلىكى

source: Max number of images
kk: Суреттердің максималды саны
ug: ئەڭ كۆپ سۈرەت سانى

source: Show paths
kk: Жолдарды көрсету
ug: يولنى كۆرسەت

source: Do rotations
kk: Бұруды орындау
ug: ئايلاندۇر

source: Print stats
kk: Статистиканы шығару
ug: ئىستاتىستىكىنى باس

source: Location
kk: Орналасуы
ug: ئورنى

source: Background color
kk: Фон түсі
ug: تەگلىك رەڭگى

source: Do not randomize images
kk: Суреттерді кездейсоқ таңдамау
ug: سۈرەتنى ئىختىيارىيلاشتۇرما

source: Do not stretch images
kk: Суреттерді созбау
ug: سۈرەتنى يايما

source: Do not crop images
kk: Суреттерді қиып алмау
ug: سۈرەتنى قايچىلىما

source: Restore Defaults
kk: Әдепкі қалпына келтіру
ug: كۆڭۈلدىكىگە قايتۇر

source: Preferences
kk: Баптаулар
ug: مايىللىق

source: About
kk: Осы туралы
ug: ھەققىدە

source: Video
kk: Видео
ug: سىن

source: Configure an individual screensaver
kk: Жеке экран сақтағышын баптау
ug: خاس ئېكران قوغدىغۇچ سەپلىمىسى

source: screensaver name to configure
kk: бапталатын экран сақтағышының аты
ug: سەپلەيدىغان ئېكران قوغدىغۇچ ئىسمى

source: check if screensaver is configurable
kk: экран сақтағышының бапталатынын тексеру
ug: ئېكران قوغدىغۇچنىڭ سەپلەشچانلىقىنى تەكشۈرىدۇ

source: Unable to configure screensaver
kk: Экран сақтағышын баптау мүмкін емес
ug: ئېكران قوغدىغۇچنى سەپلىيەلمەيدۇ

source: Screensaver required.
kk: Экран сақтағышы қажет.
ug: ئېكران قوغدىغۇچ زۆرۈر.

source: File not found: %s
kk: Файл табылмады: %s
ug: ھۆججەتنى تاپالمىدى: %s

source: Unrecognized file type: %s
kk: Танылмаған файл түрі: %s
ug: تونۇمايدىغان ھۆججەت تۈرى: %s

source: Failed to process file: %s
kk: Файлды өңдеу сәтсіз аяқталды: %s
ug: ھۆججەتنى بىر تەرەپ قىلالمىدى: %s

source: Screensaver %s is configurable.
kk: %s экран сақтағышын баптауға болады.
ug: ئېكران قوغدىغۇچ %s نى سەپلىگىلى بولىدۇ.

source: Screensaver %s is not configurable.
kk: %s экран сақтағышын баптауға болмайды.
ug: ئېكران قوغدىغۇچ %s نى سەپلىگىلى بولمايدۇ.

source: Screensaver %s has no configuration options.
kk: %s экран сақтағышында баптау опциялары жоқ.
ug: ئېكران قوغدىغۇچ %s نىڭ سەپلەش تاللانمىسى يوق.

source: Show debugging output
kk: Жөндеу шығысын көрсету
ug: سازلاپ چىقىرىشنى كۆرسەت

source: Show the logout button
kk: Шығу батырмасын көрсету
ug: تىزىمدىن چىق توپچىنى كۆرسەت

source: Command to invoke from the logout button
kk: Шығу батырмасынан шақырылатын команда
ug: تىزىمدىن چىق توپچىسى چاقىرىدىغان بۇيرۇق

source: Show the switch user button
kk: Пайдаланушыны ауыстыру батырмасын көрсету
ug: ئىشلەتكۈچى ئالماشتۇر توپچىسىنى كۆرسەت

source: Message to show in the dialog
kk: Сұхбат терезесінде көрсетілетін хабарлама
ug: سۆزلەشكۈدە كۆرۈنىدىغان ئۇچۇر

source: MESSAGE
kk: ХАБАРЛАМА
ug: ئۇچۇر

source: Not used
kk: Қолданылмайды
ug: ئىشلىتىلمىگەن

source: Monitor height
kk: Монитор биіктігі
ug: كۆزەتكۈچ ئېگىزلىكى

source: Monitor width
kk: Монитор ені
ug: كۆزەتكۈچ كەڭلىكى

source: Monitor index
kk: Монитор нұсқағышы
ug: كۆزەتكۈچ ئىندېكسى

source: Checking...
kk: Тексеру...
ug: تەكشۈرۈۋاتىدۇ…

source: Enter your password
kk: Парольді енгізіңіз
ug: ئىم كىرگۈزۈلىدۇ

source: You have the Caps Lock key on.
kk: Caps Lock пернесі іске қосулы тұр.
ug: سىز Caps Lock كۇنۇپكىسىنى ئاچتىڭىز.

source: _Switch User
kk: _Пайдаланушыны ауыстыру
ug: ئىشلەتكۈچى ئالماشتۇر(_S)

source: _Log Out
kk: _Шығу
ug: تىزىمدىن چىق(_L)

source: _Cancel
kk: _Бас тарту
ug: ۋاز كەچ(_C)

source: _Unlock
kk: _Блоктаудан босату
ug: قۇلۇپ ئاچ(_U)

source: Settings manager socket
ug: باشقۇرغۇچى ئوقۇر تەڭشىكى

source: SOCKET ID
ug: ئوقۇر كىملىكى

source: Blank screen
kk: Бос экран
ug: قارا ئېكران

source: Random
kk: Кездейсоқ
ug: ئىختىيارىي

source: Setting locked by administrator.
kk: Баптауды әкімші бұғаттаған.
ug: تەڭشەكنى باشقۇرغۇچى قۇلۇپلىغان.

source: Could not load the main interface
kk: Негізгі интерфейсті жүктеу мүмкін емес
ug: ئاساسىي ئارا يۈزنى يۈكلىيەلمەيدۇ

source: Please make sure that the screensaver is properly installed
kk: Экран сақтағышының дұрыс орнатылғанына көз жеткізіңіз
ug: ئېكران قوغدىغۇچنىڭ توغرا ئورنىتىلغانلىقىنى جەزملەڭ

source: Screensaver Preview
kk: Экран сақтағышын алдын ала қарау
ug: ئېكران قوغدىغۇچنى ئالدىن كۆزەت

source: <b>Screensaver preview</b>
kk: <b>Экран сақтағышын алдын ала қарау</b>
ug: <b>ئېكران قوغدىغۇچنى ئالدىن كۆزەت</b>

source: Screensaver Preferences
kk: Экран сақтағышының баптаулары
ug: ئېكران قوغدىغۇچ مايىللىقى

source: Power _Management
kk: Қуатты _басқару
ug: توك مەنبە باشقۇرۇش

source: Preview
kk: Алдын ала қарау
ug: ئالدىن كۆزەت

source: Running as root
kk: Root ретінде орындалуда
ug: root سالاھىيىتىدە ئىجرا قىل

source: The screen will not be locked for the root user.
kk: Root пайдаланушысы үшін экран бұғатталмайды.
ug: ئېكران root ئىشلەتكۈچىگە قۇلۇپلانمايدۇ.

source: Resolve
kk: Шешу
ug: ھەل قىلىش

source: Xfce Power Manager is not configured to handle laptop lid events
kk: Xfce қуат басқарушысы ноутбук қақпағының оқиғаларын өңдеуге бапталмаған
ug: Xfce توك مەنبە باشقۇرغۇچ يان كومپيۇتېر قاپقاق ھادىسىسىنى بىر تەرەپ قىلىشقا سەپلەنمىگەن

source: Your computer may not be locked when you close the lid.
kk: Қақпақты жапқан кезде компьютер бұғатталмауы мүмкін.
ug: كومپيۇتېرنىڭ قاپقىقى يېپىلسا كومپيۇتېرىڭىز قۇلۇپلانماسلىقى مۇمكىن.

source: Enable Screensaver
kk: Экран сақтағышын іске қосу
ug: ئېكران قوغدىغۇچنى قوزغات

source: Theme
kk: Тема
ug: ئۆرنەك

source: Configure screensaver
kk: Экран сақтағышын баптау
ug: ئېكران قوغدىغۇچ سەپلىمىسى

source: Configure...
kk: Баптау...
ug: سەپلىمە…

source: Change theme after:
kk: Теманы келесі уақыттан кейін өзгерту:
ug: ئۆرنەك ئالماشتۇرۇش ۋاقتى:

source: minutes
kk: минут
ug: مىنۇت

source: Activate screensaver when computer is idle
kk: Компьютер әрекетсіз болғанда экран сақтағышын белсендіру
ug: كومپيۇتېر بوش ۋاقىتتا ئېكران قوغدىغۇچنى ئاكتىپلا

source: Regard the computer as _idle after:
kk: Компьютерді келесі уақыттан кейін ә_рекетсіз деп санау:
ug: كومپيۇتېرنى بىكار دەپ قارايدىغان ۋاقىت(_I):

source: Inhibit screensaver for fullscreen applications
kk: Толық экранды қолданбалар үшін экран сақтағышын болдырмау
ug: پۈتۈن ئېكران پىروگراممىسىنىڭ ئېكران قوغدىغۇچنى قوزغىتىشىنى چەكلەيدۇ

source: Enable Lock Screen
kk: Экранды бұғаттауды іске қосу
ug: ئېكران قۇلۇپلاشنى قوزغات

source: Lock Screen with Screensaver
kk: Экранды экран сақтағышымен бірге бұғаттау
ug: ئېكران قوغدىغۇچتا ئېكراننى قۇلۇپلا

source: Lock the screen after the screensaver is active for:
kk: Экран сақтағышы белсенді болғаннан кейін экранды бұғаттау уақыты:
ug: ئېكران قوغدىغۇچ ئاكتىپلانغاندىن كېيىن ئېكراننى قۇلۇپلايدۇ:

source: On Screen Keyboard
kk: Экрандағы пернетақта
ug: ئېكران ھەرپتاختىسى

source: On screen keyboard command:
kk: Экрандағы пернетақта командасы:
ug: ئېكران ھەرپتاختا بۇيرۇقى:

source: Session Status Messages
kk: Сеанс күйінің хабарламалары
ug: ئەڭگىمە ھالەت ئۇچۇرى

source: Logout
kk: Шығу
ug: تىزىمدىن چىق

source: Logout command:
kk: Шығу командасы:
ug: تىزىمدىن چىق بۇيرۇقى:

source: Enable logout after:
kk: Кейін жүйеден шығуды іске қосу:
ug: تىزىمدىن چىقىشنى قوزغىتىدىغان ۋاقىت:

source: User Switching
kk: Пайдаланушыны ауыстыру
ug: ئىشلەتكۈچى ئالماشتۇر

source: Lock Screen with System Sleep
kk: Жүйе ұйқы режиміне өткенде экранды бұғаттау
ug: سىستېما ئۇخلىغاندا ئېكران قۇلۇپلا

source: Lock Screen
kk: Экранды бұғаттау
ug: ئېكران قۇلۇپلا

source: Enable debugging code
kk: Жөндеу кодын іске қосу
ug: سازلاش كودىنى قوزغات

source: Launch screensaver and locker program
kk: Экран сақтағышын және бұғаттау бағдарламасын жөнелту
ug: ئېكران قوغدىغۇچ ۋە قۇلۇپلىغۇچ پىروگراممىسىنى قوزغات

source: XKB initialization error
kk: XKB инициализациялау қатесі
ug: XKB نى دەسلەپلەشتۈرۈشتە خاتالىق كۆرۈلدى
